ranjithaguna/pv/LED_Demo/source/pic32cx/component/led.h
/**
 * \brief Component description for PIC32CX/0525SG12 LED
 *
 * Copyright (c) 2018 Microchip Technology Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description version 2018-04-24T21:15:30Z */
#ifndef _PIC32CX_0525SG12_LED_COMPONENT_H_
#define _PIC32CX_0525SG12_LED_COMPONENT_H_

/** \addtogroup PIC32CX_0525SG12_LED The blinking/breathing hardware is implemented using a PWM. The PWM can be driven either by the 48 MHz\n        clock or by a 32.768 KHz clock input. When driven by the 48 MHz clock, the PWM can be used as a standard 8-bit\n        PWM in order to control a fan. When used to drive blinking or breathing LEDs, the 32.768 KHz clock source is used.
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR LED */
/* ========================================================================== */

/* -------- LED_CONFIG : (LED Offset: 0x00) (R/W 32) LED Configuration -------- */

typedef union
{
  struct
  {
    uint32_t CONTROL:2;                 /**< bit:   0..1  CONTROL 3=PWM is always on\n                  2=LED blinking (standard PWM)\n                  1=LED breathing configuration\n                  0=PWM is always off. All internal registers and counters are reset to 0. Clocks are gated */
    uint32_t CLOCK_SOURCE:1;            /**< bit:      2  1=Clock source is the 48 MHz clock, 0=Clock source is the 32.768 KHz clock */
    uint32_t SYNCHRONIZE:1;             /**< bit:      3  SYNCHRONIZE  When this bit is '1', all counters for all LEDs are reset to their initial values. When this bit is '0' in the LED Configuration Register for all LEDs, then all counters for LEDs that are configured to blink or breathe will increment or decrement, as required. */
    uint32_t PWM_SIZE:2;                /**< bit:   4..5  PWM_SIZE This bit controls the behavior of PWM:\n                  3=Reserved\n                  2=PWM is configured as a 6-bit PWM\n                  1=PWM is configured as a 7-bit PWM\n                  0=PWM is configured as an 8-bit PWM */
    uint32_t ENABLE_UPDATE:1;           /**< bit:      6  ENABLE_UPDATE  This bit is set to 1 when written with a '1'. Writes of '0' have no effect. Hardware clears this bit to 0 when the breathing configuration registers are updated at the end of a PWM period. The current state of the bit is readable any time. */
    uint32_t RESET:1;                   /**< bit:      7  RESET  Writes of '1' to this bit resets the PWM registers to their default values. This bit is self clearing. Writes of '0' to this bit have no effect. */
    uint32_t WDT_RELOAD:8;              /**< bit:  8..15  WDT_RELOAD  The PWM Watchdog Timer counter reload value. On system reset, it defaults to 14h, which corresponds to a 4 second Watchdog timeout value. */
    uint32_t SYMMETRY:1;                /**< bit:     16  SYMMETRY  1=The rising and falling ramp times are in Asymmetric mode.\n                  0=The rising and falling ramp times are in Symmetric mode. */
    uint32_t :15;                       /**< bit: 17..31  Reserved                                      */
  };
  uint32_t w;
} __LED_CONFIG_bits_t;
#define LED_CONFIG_RESETVALUE               (0x00U)                                       /**<  (LED_CONFIG) LED Configuration  Reset Value */

#define LED_CONFIG_CONTROL_Pos                (0)                                            /**< (LED_CONFIG) CONTROL 3=PWM is always on\n                  2=LED blinking (standard PWM)\n                  1=LED breathing configuration\n                  0=PWM is always off. All internal registers and counters are reset to 0. Clocks are gated Position */
#define LED_CONFIG_CONTROL_Msk                (0x3U << LED_CONFIG_CONTROL_Pos)               /**< (LED_CONFIG) CONTROL 3=PWM is always on\n                  2=LED blinking (standard PWM)\n                  1=LED breathing configuration\n                  0=PWM is always off. All internal registers and counters are reset to 0. Clocks are gated Mask */
#define LED_CONFIG_CONTROL(value)             (LED_CONFIG_CONTROL_Msk & ((value) << LED_CONFIG_CONTROL_Pos))
#define LED_CONFIG_CLOCK_SOURCE_Pos           (2)                                            /**< (LED_CONFIG) 1=Clock source is the 48 MHz clock, 0=Clock source is the 32.768 KHz clock Position */
#define LED_CONFIG_CLOCK_SOURCE_Msk           (0x1U << LED_CONFIG_CLOCK_SOURCE_Pos)          /**< (LED_CONFIG) 1=Clock source is the 48 MHz clock, 0=Clock source is the 32.768 KHz clock Mask */
#define LED_CONFIG_SYNCHRONIZE_Pos            (3)                                            /**< (LED_CONFIG) SYNCHRONIZE  When this bit is '1', all counters for all LEDs are reset to their initial values. When this bit is '0' in the LED Configuration Register for all LEDs, then all counters for LEDs that are configured to blink or breathe will increment or decrement, as required. Position */
#define LED_CONFIG_SYNCHRONIZE_Msk            (0x1U << LED_CONFIG_SYNCHRONIZE_Pos)           /**< (LED_CONFIG) SYNCHRONIZE  When this bit is '1', all counters for all LEDs are reset to their initial values. When this bit is '0' in the LED Configuration Register for all LEDs, then all counters for LEDs that are configured to blink or breathe will increment or decrement, as required. Mask */
#define LED_CONFIG_PWM_SIZE_Pos               (4)                                            /**< (LED_CONFIG) PWM_SIZE This bit controls the behavior of PWM:\n                  3=Reserved\n                  2=PWM is configured as a 6-bit PWM\n                  1=PWM is configured as a 7-bit PWM\n                  0=PWM is configured as an 8-bit PWM Position */
#define LED_CONFIG_PWM_SIZE_Msk               (0x3U << LED_CONFIG_PWM_SIZE_Pos)              /**< (LED_CONFIG) PWM_SIZE This bit controls the behavior of PWM:\n                  3=Reserved\n                  2=PWM is configured as a 6-bit PWM\n                  1=PWM is configured as a 7-bit PWM\n                  0=PWM is configured as an 8-bit PWM Mask */
#define LED_CONFIG_PWM_SIZE(value)            (LED_CONFIG_PWM_SIZE_Msk & ((value) << LED_CONFIG_PWM_SIZE_Pos))
#define LED_CONFIG_ENABLE_UPDATE_Pos          (6)                                            /**< (LED_CONFIG) ENABLE_UPDATE  This bit is set to 1 when written with a '1'. Writes of '0' have no effect. Hardware clears this bit to 0 when the breathing configuration registers are updated at the end of a PWM period. The current state of the bit is readable any time. Position */
#define LED_CONFIG_ENABLE_UPDATE_Msk          (0x1U << LED_CONFIG_ENABLE_UPDATE_Pos)         /**< (LED_CONFIG) ENABLE_UPDATE  This bit is set to 1 when written with a '1'. Writes of '0' have no effect. Hardware clears this bit to 0 when the breathing configuration registers are updated at the end of a PWM period. The current state of the bit is readable any time. Mask */
#define LED_CONFIG_RESET_Pos                  (7)                                            /**< (LED_CONFIG) RESET  Writes of '1' to this bit resets the PWM registers to their default values. This bit is self clearing. Writes of '0' to this bit have no effect. Position */
#define LED_CONFIG_RESET_Msk                  (0x1U << LED_CONFIG_RESET_Pos)                 /**< (LED_CONFIG) RESET  Writes of '1' to this bit resets the PWM registers to their default values. This bit is self clearing. Writes of '0' to this bit have no effect. Mask */
#define LED_CONFIG_WDT_RELOAD_Pos             (8)                                            /**< (LED_CONFIG) WDT_RELOAD  The PWM Watchdog Timer counter reload value. On system reset, it defaults to 14h, which corresponds to a 4 second Watchdog timeout value. Position */
#define LED_CONFIG_WDT_RELOAD_Msk             (0xFFU << LED_CONFIG_WDT_RELOAD_Pos)           /**< (LED_CONFIG) WDT_RELOAD  The PWM Watchdog Timer counter reload value. On system reset, it defaults to 14h, which corresponds to a 4 second Watchdog timeout value. Mask */
#define LED_CONFIG_WDT_RELOAD(value)          (LED_CONFIG_WDT_RELOAD_Msk & ((value) << LED_CONFIG_WDT_RELOAD_Pos))
#define LED_CONFIG_SYMMETRY_Pos               (16)                                           /**< (LED_CONFIG) SYMMETRY  1=The rising and falling ramp times are in Asymmetric mode.\n                  0=The rising and falling ramp times are in Symmetric mode. Position */
#define LED_CONFIG_SYMMETRY_Msk               (0x1U << LED_CONFIG_SYMMETRY_Pos)              /**< (LED_CONFIG) SYMMETRY  1=The rising and falling ramp times are in Asymmetric mode.\n                  0=The rising and falling ramp times are in Symmetric mode. Mask */
#define LED_CONFIG_Msk                        (0x0001FFFFUL)                                 /**< (LED_CONFIG) Register Mask  */

