ranjithaguna/pv/LED_Demo/source/pic32cx/component/led.h
/* -------- LED_LIMITS : (LED Offset: 0x04) (R/W 32) LED Limits This register may be written at any time. Values written into the register are held in an holding register, which is transferred into the actual register at the end of a PWM period. The two byte fields may be written independently. Reads of this register return the current contents and not the value of the holding register. -------- */

typedef union
{
  struct
  {
    uint32_t MINIMUM:8;                 /**< bit:   0..7  In breathing mode, when the current duty cycle is less than or equal to this value the breathing apparatus holds the current duty cycle for the period specified by the field LD in register LED_DELAY, then starts incrementing the current duty cycle In blinking mode, this field defines the duty cycle of the blink function. */
    uint32_t MAXIMUM:8;                 /**< bit:  8..15  In breathing mode, when the current duty cycle is greater than or equal to this value the breathing apparatus holds the current duty cycle for the period specified by the field HD in register LED_DELAY, then starts decrementing the current duty cycle */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __LED_LIMITS_bits_t;
#define LED_LIMITS_RESETVALUE               (0x00U)                                       /**<  (LED_LIMITS) LED Limits This register may be written at any time. Values written into the register are held in an holding register, which is transferred into the actual register at the end of a PWM period. The two byte fields may be written independently. Reads of this register return the current contents and not the value of the holding register.  Reset Value */

#define LED_LIMITS_MINIMUM_Pos                (0)                                            /**< (LED_LIMITS) In breathing mode, when the current duty cycle is less than or equal to this value the breathing apparatus holds the current duty cycle for the period specified by the field LD in register LED_DELAY, then starts incrementing the current duty cycle In blinking mode, this field defines the duty cycle of the blink function. Position */
#define LED_LIMITS_MINIMUM_Msk                (0xFFU << LED_LIMITS_MINIMUM_Pos)              /**< (LED_LIMITS) In breathing mode, when the current duty cycle is less than or equal to this value the breathing apparatus holds the current duty cycle for the period specified by the field LD in register LED_DELAY, then starts incrementing the current duty cycle In blinking mode, this field defines the duty cycle of the blink function. Mask */
#define LED_LIMITS_MINIMUM(value)             (LED_LIMITS_MINIMUM_Msk & ((value) << LED_LIMITS_MINIMUM_Pos))
#define LED_LIMITS_MAXIMUM_Pos                (8)                                            /**< (LED_LIMITS) In breathing mode, when the current duty cycle is greater than or equal to this value the breathing apparatus holds the current duty cycle for the period specified by the field HD in register LED_DELAY, then starts decrementing the current duty cycle Position */
#define LED_LIMITS_MAXIMUM_Msk                (0xFFU << LED_LIMITS_MAXIMUM_Pos)              /**< (LED_LIMITS) In breathing mode, when the current duty cycle is greater than or equal to this value the breathing apparatus holds the current duty cycle for the period specified by the field HD in register LED_DELAY, then starts decrementing the current duty cycle Mask */
#define LED_LIMITS_MAXIMUM(value)             (LED_LIMITS_MAXIMUM_Msk & ((value) << LED_LIMITS_MAXIMUM_Pos))
#define LED_LIMITS_Msk                        (0x0000FFFFUL)                                 /**< (LED_LIMITS) Register Mask  */

/* -------- LED_DELAY : (LED Offset: 0x08) (R/W 32) LED Delay -------- */

typedef union
{
  struct
  {
    uint32_t LOW_PULSE:12;              /**< bit:  0..11  The number of PWM periods to wait before updating the current duty cycle when the current duty cycle is greater than or equal to the value MIN in register LED_LIMIT. */
    uint32_t HIGH_PULSE:12;             /**< bit: 12..23  In breathing mode, the number of PWM periods to wait before updating the current duty cycle when the current duty cycle is greater than or equal to the value MAX in register LED_LIMIT. */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  uint32_t w;
} __LED_DELAY_bits_t;
#define LED_DELAY_RESETVALUE                (0x00U)                                       /**<  (LED_DELAY) LED Delay  Reset Value */

#define LED_DELAY_LOW_PULSE_Pos               (0)                                            /**< (LED_DELAY) The number of PWM periods to wait before updating the current duty cycle when the current duty cycle is greater than or equal to the value MIN in register LED_LIMIT. Position */
#define LED_DELAY_LOW_PULSE_Msk               (0xFFFU << LED_DELAY_LOW_PULSE_Pos)            /**< (LED_DELAY) The number of PWM periods to wait before updating the current duty cycle when the current duty cycle is greater than or equal to the value MIN in register LED_LIMIT. Mask */
#define LED_DELAY_LOW_PULSE(value)            (LED_DELAY_LOW_PULSE_Msk & ((value) << LED_DELAY_LOW_PULSE_Pos))
#define LED_DELAY_HIGH_PULSE_Pos              (12)                                           /**< (LED_DELAY) In breathing mode, the number of PWM periods to wait before updating the current duty cycle when the current duty cycle is greater than or equal to the value MAX in register LED_LIMIT. Position */
#define LED_DELAY_HIGH_PULSE_Msk              (0xFFFU << LED_DELAY_HIGH_PULSE_Pos)           /**< (LED_DELAY) In breathing mode, the number of PWM periods to wait before updating the current duty cycle when the current duty cycle is greater than or equal to the value MAX in register LED_LIMIT. Mask */
#define LED_DELAY_HIGH_PULSE(value)           (LED_DELAY_HIGH_PULSE_Msk & ((value) << LED_DELAY_HIGH_PULSE_Pos))
#define LED_DELAY_Msk                         (0x00FFFFFFUL)                                 /**< (LED_DELAY) Register Mask  */

/* -------- LED_UPDATE_STEPSIZE : (LED Offset: 0x0c) (R/W 32) This register has eight segment fields which provide the amount the current duty cycle is adjusted at the end of every PWM period. Segment field selection is decoded based on the segment index. The segment index equation utilized depends on the SYMMETRY bit in the LED Configuration Register Register)              . In Symmetric Mode the Segment_Index[2:0] = Duty Cycle Bits[7:5]\n              . In Asymmetric Mode the Segment_Index[2:0] is the bit concatenation of following: Segment_Index[2] = (FALLING RAMP TIME in Figure 30-3, Clipping Example) and Segment_Index[1:0] = Duty Cycle Bits[7:6]. -------- */

typedef union
{
  struct
  {
    uint32_t STEP0:4;                   /**< bit:   0..3  Amount the current duty cycle is adjusted at the end of every PWM period when the segment index is equal to 000. */
    uint32_t STEP1:4;                   /**< bit:   4..7  Amount the current duty cycle is adjusted at the end of every PWM period when the segment index is equal to 001. */
    uint32_t STEP2:4;                   /**< bit:  8..11  Amount the current duty cycle is adjusted at the end of every PWM period when the segment index is equal to 010. */
    uint32_t STEP3:4;                   /**< bit: 12..15  Amount the current duty cycle is adjusted at the end of every PWM period when the segment index is equal to 011. */
    uint32_t STEP4:4;                   /**< bit: 16..19  Amount the current duty cycle is adjusted at the end of every PWM period when the segment index is equal to 100. */
    uint32_t STEP5:4;                   /**< bit: 20..23  Amount the current duty cycle is adjusted at the end of every PWM period when the segment index is equal to 101 */
    uint32_t STEP6:4;                   /**< bit: 24..27  Amount the current duty cycle is adjusted at the end of every PWM period when the segment index is equal to 110. */
    uint32_t STEP7:4;                   /**< bit: 28..31  Amount the current duty cycle is adjusted at the end of every PWM period when the segment index is equal to 111. */
  };
  uint32_t w;
} __LED_UPDATE_STEPSIZE_bits_t;
#define LED_UPDATE_STEPSIZE_RESETVALUE      (0x00U)                                       /**<  (LED_UPDATE_STEPSIZE) This register has eight segment fields which provide the amount the current duty cycle is adjusted at the end of every PWM period. Segment field selection is decoded based on the segment index. The segment index equation utilized depends on the SYMMETRY bit in the LED Configuration Register Register)              . In Symmetric Mode the Segment_Index[2:0] = Duty Cycle Bits[7:5]\n              . In Asymmetric Mode the Segment_Index[2:0] is the bit concatenation of following: Segment_Index[2] = (FALLING RAMP TIME in Figure 30-3, Clipping Example) and Segment_Index[1:0] = Duty Cycle Bits[7:6].  Reset Value */

