ranjithaguna/pv/LED_Demo/source/pic32cx/component/led.h
#define LED_UPDATE_STEPSIZE_STEP0_Pos         (0)                                            /**< (LED_UPDATE_STEPSIZE) Amount the current duty cycle is adjusted at the end of every PWM period when the segment index is equal to 000. Position */
#define LED_UPDATE_STEPSIZE_STEP0_Msk         (0xFU << LED_UPDATE_STEPSIZE_STEP0_Pos)        /**< (LED_UPDATE_STEPSIZE) Amount the current duty cycle is adjusted at the end of every PWM period when the segment index is equal to 000. Mask */
#define LED_UPDATE_STEPSIZE_STEP0(value)      (LED_UPDATE_STEPSIZE_STEP0_Msk & ((value) << LED_UPDATE_STEPSIZE_STEP0_Pos))
#define LED_UPDATE_STEPSIZE_STEP1_Pos         (4)                                            /**< (LED_UPDATE_STEPSIZE) Amount the current duty cycle is adjusted at the end of every PWM period when the segment index is equal to 001. Position */
#define LED_UPDATE_STEPSIZE_STEP1_Msk         (0xFU << LED_UPDATE_STEPSIZE_STEP1_Pos)        /**< (LED_UPDATE_STEPSIZE) Amount the current duty cycle is adjusted at the end of every PWM period when the segment index is equal to 001. Mask */
#define LED_UPDATE_STEPSIZE_STEP1(value)      (LED_UPDATE_STEPSIZE_STEP1_Msk & ((value) << LED_UPDATE_STEPSIZE_STEP1_Pos))
#define LED_UPDATE_STEPSIZE_STEP2_Pos         (8)                                            /**< (LED_UPDATE_STEPSIZE) Amount the current duty cycle is adjusted at the end of every PWM period when the segment index is equal to 010. Position */
#define LED_UPDATE_STEPSIZE_STEP2_Msk         (0xFU << LED_UPDATE_STEPSIZE_STEP2_Pos)        /**< (LED_UPDATE_STEPSIZE) Amount the current duty cycle is adjusted at the end of every PWM period when the segment index is equal to 010. Mask */
#define LED_UPDATE_STEPSIZE_STEP2(value)      (LED_UPDATE_STEPSIZE_STEP2_Msk & ((value) << LED_UPDATE_STEPSIZE_STEP2_Pos))
#define LED_UPDATE_STEPSIZE_STEP3_Pos         (12)                                           /**< (LED_UPDATE_STEPSIZE) Amount the current duty cycle is adjusted at the end of every PWM period when the segment index is equal to 011. Position */
#define LED_UPDATE_STEPSIZE_STEP3_Msk         (0xFU << LED_UPDATE_STEPSIZE_STEP3_Pos)        /**< (LED_UPDATE_STEPSIZE) Amount the current duty cycle is adjusted at the end of every PWM period when the segment index is equal to 011. Mask */
#define LED_UPDATE_STEPSIZE_STEP3(value)      (LED_UPDATE_STEPSIZE_STEP3_Msk & ((value) << LED_UPDATE_STEPSIZE_STEP3_Pos))
#define LED_UPDATE_STEPSIZE_STEP4_Pos         (16)                                           /**< (LED_UPDATE_STEPSIZE) Amount the current duty cycle is adjusted at the end of every PWM period when the segment index is equal to 100. Position */
#define LED_UPDATE_STEPSIZE_STEP4_Msk         (0xFU << LED_UPDATE_STEPSIZE_STEP4_Pos)        /**< (LED_UPDATE_STEPSIZE) Amount the current duty cycle is adjusted at the end of every PWM period when the segment index is equal to 100. Mask */
#define LED_UPDATE_STEPSIZE_STEP4(value)      (LED_UPDATE_STEPSIZE_STEP4_Msk & ((value) << LED_UPDATE_STEPSIZE_STEP4_Pos))
#define LED_UPDATE_STEPSIZE_STEP5_Pos         (20)                                           /**< (LED_UPDATE_STEPSIZE) Amount the current duty cycle is adjusted at the end of every PWM period when the segment index is equal to 101 Position */
#define LED_UPDATE_STEPSIZE_STEP5_Msk         (0xFU << LED_UPDATE_STEPSIZE_STEP5_Pos)        /**< (LED_UPDATE_STEPSIZE) Amount the current duty cycle is adjusted at the end of every PWM period when the segment index is equal to 101 Mask */
#define LED_UPDATE_STEPSIZE_STEP5(value)      (LED_UPDATE_STEPSIZE_STEP5_Msk & ((value) << LED_UPDATE_STEPSIZE_STEP5_Pos))
#define LED_UPDATE_STEPSIZE_STEP6_Pos         (24)                                           /**< (LED_UPDATE_STEPSIZE) Amount the current duty cycle is adjusted at the end of every PWM period when the segment index is equal to 110. Position */
#define LED_UPDATE_STEPSIZE_STEP6_Msk         (0xFU << LED_UPDATE_STEPSIZE_STEP6_Pos)        /**< (LED_UPDATE_STEPSIZE) Amount the current duty cycle is adjusted at the end of every PWM period when the segment index is equal to 110. Mask */
#define LED_UPDATE_STEPSIZE_STEP6(value)      (LED_UPDATE_STEPSIZE_STEP6_Msk & ((value) << LED_UPDATE_STEPSIZE_STEP6_Pos))
#define LED_UPDATE_STEPSIZE_STEP7_Pos         (28)                                           /**< (LED_UPDATE_STEPSIZE) Amount the current duty cycle is adjusted at the end of every PWM period when the segment index is equal to 111. Position */
#define LED_UPDATE_STEPSIZE_STEP7_Msk         (0xFU << LED_UPDATE_STEPSIZE_STEP7_Pos)        /**< (LED_UPDATE_STEPSIZE) Amount the current duty cycle is adjusted at the end of every PWM period when the segment index is equal to 111. Mask */
#define LED_UPDATE_STEPSIZE_STEP7(value)      (LED_UPDATE_STEPSIZE_STEP7_Msk & ((value) << LED_UPDATE_STEPSIZE_STEP7_Pos))
#define LED_UPDATE_STEPSIZE_Msk               (0xFFFFFFFFUL)                                 /**< (LED_UPDATE_STEPSIZE) Register Mask  */

/* -------- LED_UPDATE_INTERVAL : (LED Offset: 0x10) (R/W 32) LED Update Interval -------- */

typedef union
{
  struct
  {
    uint32_t INTERVAL0:4;               /**< bit:   0..3  The number of PWM periods between updates to current duty cycle when the segment index is equal to 000b. */
    uint32_t INTERVAL1:4;               /**< bit:   4..7  The number of PWM periods between updates to current duty cycle when the segment index is equal to 001b. */
    uint32_t INTERVAL2:4;               /**< bit:  8..11  The number of PWM periods between updates to current duty cycle when the segment index is equal to 010b. */
    uint32_t INTERVAL3:4;               /**< bit: 12..15  The number of PWM periods between updates to current duty cycle when the segment index is equal to 011b. */
    uint32_t INTERVAL4:4;               /**< bit: 16..19  The number of PWM periods between updates to current duty cycle when the segment index is equal to 100b. */
    uint32_t INTERVAL5:4;               /**< bit: 20..23  The number of PWM periods between updates to current duty cycle when the segment index is equal to 101b. */
    uint32_t INTERVAL6:4;               /**< bit: 24..27  The number of PWM periods between updates to current duty cycle when the segment index is equal to 110b. */
    uint32_t INTERVAL7:4;               /**< bit: 28..31  The number of PWM periods between updates to current duty cycle when the segment index is equal to 111b. */
  };
  uint32_t w;
} __LED_UPDATE_INTERVAL_bits_t;
#define LED_UPDATE_INTERVAL_RESETVALUE      (0x00U)                                       /**<  (LED_UPDATE_INTERVAL) LED Update Interval  Reset Value */

#define LED_UPDATE_INTERVAL_INTERVAL0_Pos     (0)                                            /**< (LED_UPDATE_INTERVAL) The number of PWM periods between updates to current duty cycle when the segment index is equal to 000b. Position */
#define LED_UPDATE_INTERVAL_INTERVAL0_Msk     (0xFU << LED_UPDATE_INTERVAL_INTERVAL0_Pos)    /**< (LED_UPDATE_INTERVAL) The number of PWM periods between updates to current duty cycle when the segment index is equal to 000b. Mask */
#define LED_UPDATE_INTERVAL_INTERVAL0(value)  (LED_UPDATE_INTERVAL_INTERVAL0_Msk & ((value) << LED_UPDATE_INTERVAL_INTERVAL0_Pos))
#define LED_UPDATE_INTERVAL_INTERVAL1_Pos     (4)                                            /**< (LED_UPDATE_INTERVAL) The number of PWM periods between updates to current duty cycle when the segment index is equal to 001b. Position */
#define LED_UPDATE_INTERVAL_INTERVAL1_Msk     (0xFU << LED_UPDATE_INTERVAL_INTERVAL1_Pos)    /**< (LED_UPDATE_INTERVAL) The number of PWM periods between updates to current duty cycle when the segment index is equal to 001b. Mask */
#define LED_UPDATE_INTERVAL_INTERVAL1(value)  (LED_UPDATE_INTERVAL_INTERVAL1_Msk & ((value) << LED_UPDATE_INTERVAL_INTERVAL1_Pos))
#define LED_UPDATE_INTERVAL_INTERVAL2_Pos     (8)                                            /**< (LED_UPDATE_INTERVAL) The number of PWM periods between updates to current duty cycle when the segment index is equal to 010b. Position */
#define LED_UPDATE_INTERVAL_INTERVAL2_Msk     (0xFU << LED_UPDATE_INTERVAL_INTERVAL2_Pos)    /**< (LED_UPDATE_INTERVAL) The number of PWM periods between updates to current duty cycle when the segment index is equal to 010b. Mask */
#define LED_UPDATE_INTERVAL_INTERVAL2(value)  (LED_UPDATE_INTERVAL_INTERVAL2_Msk & ((value) << LED_UPDATE_INTERVAL_INTERVAL2_Pos))
#define LED_UPDATE_INTERVAL_INTERVAL3_Pos     (12)                                           /**< (LED_UPDATE_INTERVAL) The number of PWM periods between updates to current duty cycle when the segment index is equal to 011b. Position */
#define LED_UPDATE_INTERVAL_INTERVAL3_Msk     (0xFU << LED_UPDATE_INTERVAL_INTERVAL3_Pos)    /**< (LED_UPDATE_INTERVAL) The number of PWM periods between updates to current duty cycle when the segment index is equal to 011b. Mask */
#define LED_UPDATE_INTERVAL_INTERVAL3(value)  (LED_UPDATE_INTERVAL_INTERVAL3_Msk & ((value) << LED_UPDATE_INTERVAL_INTERVAL3_Pos))
#define LED_UPDATE_INTERVAL_INTERVAL4_Pos     (16)                                           /**< (LED_UPDATE_INTERVAL) The number of PWM periods between updates to current duty cycle when the segment index is equal to 100b. Position */
#define LED_UPDATE_INTERVAL_INTERVAL4_Msk     (0xFU << LED_UPDATE_INTERVAL_INTERVAL4_Pos)    /**< (LED_UPDATE_INTERVAL) The number of PWM periods between updates to current duty cycle when the segment index is equal to 100b. Mask */
#define LED_UPDATE_INTERVAL_INTERVAL4(value)  (LED_UPDATE_INTERVAL_INTERVAL4_Msk & ((value) << LED_UPDATE_INTERVAL_INTERVAL4_Pos))
#define LED_UPDATE_INTERVAL_INTERVAL5_Pos     (20)                                           /**< (LED_UPDATE_INTERVAL) The number of PWM periods between updates to current duty cycle when the segment index is equal to 101b. Position */
#define LED_UPDATE_INTERVAL_INTERVAL5_Msk     (0xFU << LED_UPDATE_INTERVAL_INTERVAL5_Pos)    /**< (LED_UPDATE_INTERVAL) The number of PWM periods between updates to current duty cycle when the segment index is equal to 101b. Mask */
#define LED_UPDATE_INTERVAL_INTERVAL5(value)  (LED_UPDATE_INTERVAL_INTERVAL5_Msk & ((value) << LED_UPDATE_INTERVAL_INTERVAL5_Pos))
#define LED_UPDATE_INTERVAL_INTERVAL6_Pos     (24)                                           /**< (LED_UPDATE_INTERVAL) The number of PWM periods between updates to current duty cycle when the segment index is equal to 110b. Position */
#define LED_UPDATE_INTERVAL_INTERVAL6_Msk     (0xFU << LED_UPDATE_INTERVAL_INTERVAL6_Pos)    /**< (LED_UPDATE_INTERVAL) The number of PWM periods between updates to current duty cycle when the segment index is equal to 110b. Mask */
#define LED_UPDATE_INTERVAL_INTERVAL6(value)  (LED_UPDATE_INTERVAL_INTERVAL6_Msk & ((value) << LED_UPDATE_INTERVAL_INTERVAL6_Pos))
#define LED_UPDATE_INTERVAL_INTERVAL7_Pos     (28)                                           /**< (LED_UPDATE_INTERVAL) The number of PWM periods between updates to current duty cycle when the segment index is equal to 111b. Position */
#define LED_UPDATE_INTERVAL_INTERVAL7_Msk     (0xFU << LED_UPDATE_INTERVAL_INTERVAL7_Pos)    /**< (LED_UPDATE_INTERVAL) The number of PWM periods between updates to current duty cycle when the segment index is equal to 111b. Mask */
#define LED_UPDATE_INTERVAL_INTERVAL7(value)  (LED_UPDATE_INTERVAL_INTERVAL7_Msk & ((value) << LED_UPDATE_INTERVAL_INTERVAL7_Pos))
#define LED_UPDATE_INTERVAL_Msk               (0xFFFFFFFFUL)                                 /**< (LED_UPDATE_INTERVAL) Register Mask  */

