ranjithaguna/pv/LED_Demo/source/pic32cx/component/led.h
/* -------- LED_OUTPUT_DELAY : (LED Offset: 0x14) (R/W 32) LED Output Delay -------- */

typedef union
{
  struct
  {
    uint32_t OUTPUT_DELAY:8;            /**< bit:   0..7  The delay, in counts of the clock defined in Clock Source (CLKSRC), in which output transitions are delayed.\n     When this field is 0, there is no added transition delay. When the LED is programmed to be Always On or Always Off, the\n     Output Delay field has no effect. */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  uint32_t w;
} __LED_OUTPUT_DELAY_bits_t;
#define LED_OUTPUT_DELAY_RESETVALUE         (0x00U)                                       /**<  (LED_OUTPUT_DELAY) LED Output Delay  Reset Value */

#define LED_OUTPUT_DELAY_OUTPUT_DELAY_Pos     (0)                                            /**< (LED_OUTPUT_DELAY) The delay, in counts of the clock defined in Clock Source (CLKSRC), in which output transitions are delayed.\n     When this field is 0, there is no added transition delay. When the LED is programmed to be Always On or Always Off, the\n     Output Delay field has no effect. Position */
#define LED_OUTPUT_DELAY_OUTPUT_DELAY_Msk     (0xFFU << LED_OUTPUT_DELAY_OUTPUT_DELAY_Pos)   /**< (LED_OUTPUT_DELAY) The delay, in counts of the clock defined in Clock Source (CLKSRC), in which output transitions are delayed.\n     When this field is 0, there is no added transition delay. When the LED is programmed to be Always On or Always Off, the\n     Output Delay field has no effect. Mask */
#define LED_OUTPUT_DELAY_OUTPUT_DELAY(value)  (LED_OUTPUT_DELAY_OUTPUT_DELAY_Msk & ((value) << LED_OUTPUT_DELAY_OUTPUT_DELAY_Pos))
#define LED_OUTPUT_DELAY_Msk                  (0x000000FFUL)                                 /**< (LED_OUTPUT_DELAY) Register Mask  */

/** \brief LED register offsets definitions */
#define LED_CONFIG_OFFSET            (0x00)         /**< (LED_CONFIG) LED Configuration Offset */
#define LED_LIMITS_OFFSET            (0x04)         /**< (LED_LIMITS) LED Limits This register may be written at any time. Values written into the register are held in an holding register, which is transferred into the actual register at the end of a PWM period. The two byte fields may be written independently. Reads of this register return the current contents and not the value of the holding register. Offset */
#define LED_DELAY_OFFSET             (0x08)         /**< (LED_DELAY) LED Delay Offset */
#define LED_UPDATE_STEPSIZE_OFFSET   (0x0C)         /**< (LED_UPDATE_STEPSIZE) This register has eight segment fields which provide the amount the current duty cycle is adjusted at the end of every PWM period. Segment field selection is decoded based on the segment index. The segment index equation utilized depends on the SYMMETRY bit in the LED Configuration Register Register)              . In Symmetric Mode the Segment_Index[2:0] = Duty Cycle Bits[7:5]\n              . In Asymmetric Mode the Segment_Index[2:0] is the bit concatenation of following: Segment_Index[2] = (FALLING RAMP TIME in Figure 30-3, Clipping Example) and Segment_Index[1:0] = Duty Cycle Bits[7:6]. Offset */
#define LED_UPDATE_INTERVAL_OFFSET   (0x10)         /**< (LED_UPDATE_INTERVAL) LED Update Interval Offset */
#define LED_OUTPUT_DELAY_OFFSET      (0x14)         /**< (LED_OUTPUT_DELAY) LED Output Delay Offset */

/** \brief LED register API structure */
typedef struct
{  /* The blinking/breathing hardware is implemented using a PWM. The PWM can be driven either by the 48 MHz\n        clock or by a 32.768 KHz clock input. When driven by the 48 MHz clock, the PWM can be used as a standard 8-bit\n        PWM in order to control a fan. When used to drive blinking or breathing LEDs, the 32.768 KHz clock source is used. */
  __IO  __LED_CONFIG_bits_t            CONFIG;        /**< Offset: 0x00 (R/W  32) LED Configuration */
  __IO  __LED_LIMITS_bits_t            LIMITS;        /**< Offset: 0x04 (R/W  32) LED Limits This register may be written at any time. Values written into the register are held in an holding register, which is transferred into the actual register at the end of a PWM period. The two byte fields may be written independently. Reads of this register return the current contents and not the value of the holding register. */
  __IO  __LED_DELAY_bits_t             DELAY;         /**< Offset: 0x08 (R/W  32) LED Delay */
  __IO  __LED_UPDATE_STEPSIZE_bits_t   UPDATE_STEPSIZE; /**< Offset: 0x0C (R/W  32) This register has eight segment fields which provide the amount the current duty cycle is adjusted at the end of every PWM period. Segment field selection is decoded based on the segment index. The segment index equation utilized depends on the SYMMETRY bit in the LED Configuration Register Register)              . In Symmetric Mode the Segment_Index[2:0] = Duty Cycle Bits[7:5]\n              . In Asymmetric Mode the Segment_Index[2:0] is the bit concatenation of following: Segment_Index[2] = (FALLING RAMP TIME in Figure 30-3, Clipping Example) and Segment_Index[1:0] = Duty Cycle Bits[7:6]. */
  __IO  __LED_UPDATE_INTERVAL_bits_t   UPDATE_INTERVAL; /**< Offset: 0x10 (R/W  32) LED Update Interval */
  __IO  __LED_OUTPUT_DELAY_bits_t      LED_OUTPUT_DELAY; /**< Offset: 0x14 (R/W  32) LED Output Delay */
} led_registers_t;
/** @}  end of The blinking/breathing hardware is implemented using a PWM. The PWM can be driven either by the 48 MHz\n        clock or by a 32.768 KHz clock input. When driven by the 48 MHz clock, the PWM can be used as a standard 8-bit\n        PWM in order to control a fan. When used to drive blinking or breathing LEDs, the 32.768 KHz clock source is used. */

#endif /* _PIC32CX_0525SG12_LED_COMPONENT_H_ */
